run/case_mySA/system/blockMeshDict
 /*--------------------------------*- C++ -*------------------------------*\\
 | =========                  |                                             |
 | \\      /   F ield         | OpenFOAM: The Open Source CFD Toolbox       |
 |  \\    /    O peration     | Version*: 1.6                               |
 |   \\  /     A nd           | Web:      http://www.OpenFOAM.org           |
 |    \\/      M anipulation  |                                             |
 \\*-----------------------------------------------------------------------*/
   FoamFile
   {
      version 2.0;
      format ascii;
      class dictionary;
      object blockMeshDict;
   }
 
  //* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
 
convertToMeters 1.00;
 
 vertices
 (
  ( -10.0000  -5.0000   0.00  )  //Pt 0
  (  -0.4000  -5.0000   0.00 )
  (  -0.0976  -5.0000   0.00 )
  (   0.5336  -5.0000   0.00 )
  (   0.9254  -5.0000   0.00 )
  (   5.0000  -5.0000   0.00  )  //Pt 5
  ( -10.0000  -0.1746   0.00 )
  (  -0.4000  -0.1746   0.00 )
  (  -0.0976  -0.1746   0.00 )
  (   0.5336  -0.1631   0.00 )
  (   0.9254  -0.0899   0.00 )  //Pt 10
  (   5.0000  -0.0899   0.00 )
  ( -10.0000   0.0000   0.00 )
  (  -0.4000   0.0000   0.00 )
  (   0.0000   0.0000   0.00 )
  (   0.5113   0.0356   0.00 )  //Pt 15
  (   0.8675   0.1015   0.00 )
  (   0.9812   0.1773   0.00 )
  (   1.1812   0.1773   0.00 )
  (   5.0000   0.1773   0.00 )
  ( -10.0000   0.1550   0.00 )  //Pt 20
  (  -0.4000   0.1550   0.00 )
  (  -0.1264   0.1550   0.00 )
  (   0.4927   0.1414   0.00 )
  (   0.9075   0.2013   0.00 )
  (   0.4467   0.3360   0.00 )  //Pt 25
  (   0.9224   0.4007   0.00 )
  (   5.0000   0.4007   0.00 )
  ( -10.0000   5.0000   0.00 )
  (  -0.4000   5.0000   0.00 )
  (  -0.1264   5.0000   0.00 )
  (   0.4467   5.0000   0.00 )
  (   0.9224   5.0000   0.00 )
  (   5.0000   5.0000   0.00 )
  ( -10.0000  -5.0000   0.10  )  //Pt 0
  (  -0.4000  -5.0000   0.10 )
  (  -0.0976  -5.0000   0.10 )
  (   0.5336  -5.0000   0.10 )
  (   0.9254  -5.0000   0.10 )
  (   5.0000  -5.0000   0.10  )  //Pt 5
  ( -10.0000  -0.1746   0.10 )
  (  -0.4000  -0.1746   0.10 )
  (  -0.0976  -0.1746   0.10 )
  (   0.5336  -0.1631   0.10 )
  (   0.9254  -0.0899   0.10 )  //Pt 10
  (   5.0000  -0.0899   0.10 )
  ( -10.0000   0.0000   0.10 )
  (  -0.4000   0.0000   0.10 )
  (   0.0000   0.0000   0.10 )
  (   0.5113   0.0356   0.10 )  //Pt 15
  (   0.8675   0.1015   0.10 )
  (   0.9812   0.1773   0.10 )
  (   1.1812   0.1773   0.10 )
  (   5.0000   0.1773   0.10 )
  ( -10.0000   0.1550   0.10 )  //Pt 20
  (  -0.4000   0.1550   0.10 )
  (  -0.1264   0.1550   0.10 )
  (   0.4927   0.1414   0.10 )
  (   0.9075   0.2013   0.10 )
  (   0.4467   0.3360   0.10 )  //Pt 25
  (   0.9224   0.4007   0.10 )
  (   5.0000   0.4007   0.10 )
  ( -10.0000   5.0000   0.10 )
  (  -0.4000   5.0000   0.10 )
  (  -0.1264   5.0000   0.10 )
  (   0.4467   5.0000   0.10 )
  (   0.9224   5.0000   0.10 )
  (   5.0000   5.0000   0.10 )
 );
 
 blocks
 (
  hex ( 20 21 29 28 54 55 63 62) turbulent (60 30 1) simpleGrading ( 0.05 25.00  1)
  hex ( 21 22 30 29 55 56 64 63) turbulent (25 30 1) simpleGrading ( 0.30 25.00  1)
  hex ( 22 25 31 30 56 59 65 64) turbulent (30 30 1) simpleGrading ( 4.00 25.00  1)
  hex ( 25 26 32 31 59 60 66 65) laminar (30 30 1) simpleGrading ( 0.20 25.00  1)
  hex ( 26 27 33 32 60 61 67 66) laminar (50 30 1) simpleGrading (15.00 25.00  1)
  hex ( 18 19 27 26 52 53 61 60) laminar (50 30 1) simpleGrading (15.00  3.00  1)
  hex ( 10 11 19 18 44 45 53 52) laminar (50 40 1) simpleGrading (15.00  0.40  1)
  hex (  4  5 11 10 38 39 45 44) laminar (50 30 1) simpleGrading (15.00  0.03  1)
  hex (  3  4 10  9 37 38 44 43) laminar (25 30 1) simpleGrading ( 0.20  0.03  1)
  hex (  2  3  9  8 36 37 43 42) turbulent (25 30 1) simpleGrading ( 3.00  0.03  1)
  hex (  1  2  8  7 35 36 42 41) turbulent (25 30 1) simpleGrading ( 0.30  0.03  1)
  hex (  0  1  7  6 34 35 41 40) turbulent (60 30 1) simpleGrading ( 0.05  0.03  1)
  hex (  6  7 13 12 40 41 47 46) turbulent (60 35 1) simpleGrading ( 0.05  0.10  1)
  hex ( 12 13 21 20 46 47 55 54) turbulent (60 35 1) simpleGrading ( 0.05 10.00  1)
  hex ( 13 14 22 21 47 48 56 55) turbulent (25 35 1) simpleGrading ( 0.30 10.00  1)
  hex ( 14 23 25 22 48 57 59 56) turbulent (30 35 1) simpleGrading ( 4.00 10.00  1)
  hex ( 23 24 26 25 57 58 60 59) laminar (30 35 1) simpleGrading ( 0.20 10.00  1)
  hex ( 17 18 26 24 51 52 60 58) laminar (35 30 1) simpleGrading (10.00  3.00  1)
  hex ( 16 10 18 17 50 44 52 51) laminar (35 40 1) simpleGrading (10.00  0.40  1)
  hex (  9 10 16 15 43 44 50 49) laminar (25 35 1) simpleGrading ( 0.20  0.10  1)
  hex (  8  9 15 14 42 43 49 48) turbulent (25 35 1) simpleGrading ( 3.00  0.10  1)
  hex (  7  8 14 13 41 42 48 47) turbulent (25 35 1) simpleGrading ( 0.30  0.10  1)
 );
 
 edges
 (
      polyLine 14 23 (
          ( 0.0020  0.0020  0.0000 )
          ( 0.0025  0.0025  0.0000 )
          ( 0.0064  0.0037  0.0000 )
          ( 0.0114  0.0053  0.0000 )
          ( 0.0175  0.0073  0.0000 )
          ( 0.0247  0.0096  0.0000 )
          ( 0.0330  0.0122  0.0000 )
          ( 0.0422  0.0152  0.0000 )
          ( 0.0525  0.0184  0.0000 )
          ( 0.0638  0.0220  0.0000 )
          ( 0.0761  0.0258  0.0000 )
          ( 0.0893  0.0299  0.0000 )
          ( 0.1035  0.0342  0.0000 )
          ( 0.1185  0.0388  0.0000 )
          ( 0.1343  0.0436  0.0000 )
          ( 0.1510  0.0486  0.0000 )
          ( 0.1685  0.0538  0.0000 )
          ( 0.1866  0.0591  0.0000 )
          ( 0.2055  0.0647  0.0000 )
          ( 0.2251  0.0703  0.0000 )
          ( 0.2452  0.0761  0.0000 )
          ( 0.2659  0.0819  0.0000 )
          ( 0.2871  0.0879  0.0000 )
          ( 0.3088  0.0939  0.0000 )
          ( 0.3308  0.0999  0.0000 )
          ( 0.3533  0.1059  0.0000 )
          ( 0.3760  0.1120  0.0000 )
          ( 0.3991  0.1180  0.0000 )
          ( 0.4223  0.1240  0.0000 )
          ( 0.4457  0.1299  0.0000 )
          ( 0.4691  0.1357  0.0000 )
        )
      polyLine 23 24 (
          ( 0.5162  0.1469  0.0000 )
          ( 0.5397  0.1523  0.0000 )
          ( 0.5630  0.1576  0.0000 )
          ( 0.5862  0.1626  0.0000 )
          ( 0.6092  0.1674  0.0000 )
          ( 0.6319  0.1719  0.0000 )
          ( 0.6543  0.1762  0.0000 )
          ( 0.6763  0.1802  0.0000 )
          ( 0.6979  0.1839  0.0000 )
          ( 0.7191  0.1873  0.0000 )
          ( 0.7397  0.1903  0.0000 )
          ( 0.7597  0.1931  0.0000 )
          ( 0.7791  0.1954  0.0000 )
          ( 0.7979  0.1974  0.0000 )
          ( 0.8160  0.1991  0.0000 )
          ( 0.8333  0.2004  0.0000 )
          ( 0.8499  0.2013  0.0000 )
          ( 0.8656  0.2018  0.0000 )
          ( 0.8805  0.2020  0.0000 )
          ( 0.8944  0.2018  0.0000 )
        )
      polyLine 24 17 (
          ( 0.9196  0.2004  0.0000 )
          ( 0.9307  0.1991  0.0000 )
          ( 0.9407  0.1975  0.0000 )
          ( 0.9498  0.1956  0.0000 )
          ( 0.9578  0.1933  0.0000 )
          ( 0.9647  0.1907  0.0000 )
          ( 0.9705  0.1878  0.0000 )
          ( 0.9752  0.1846  0.0000 )
          ( 0.9787  0.1811  0.0000 )
        )
      polyLine 17 16 (
          ( 0.9817  0.1645  0.0000 )
          ( 0.9795  0.1600  0.0000 )
          ( 0.9762  0.1554  0.0000 )
          ( 0.9717  0.1507  0.0000 )
          ( 0.9661  0.1459  0.0000 )
          ( 0.9594  0.1411  0.0000 )
          ( 0.9516  0.1362  0.0000 )
          ( 0.9426  0.1312  0.0000 )
          ( 0.9326  0.1262  0.0000 )
          ( 0.9216  0.1212  0.0000 )
          ( 0.9095  0.1163  0.0000 )
          ( 0.8965  0.1113  0.0000 )
          ( 0.8824  0.1064  0.0000 )
        )
      polyLine 16 15 (
          ( 0.8516  0.0967  0.0000 )
          ( 0.8349  0.0920  0.0000 )
          ( 0.8173  0.0874  0.0000 )
          ( 0.7990  0.0828  0.0000 )
          ( 0.7799  0.0784  0.0000 )
          ( 0.7602  0.0741  0.0000 )
          ( 0.7398  0.0699  0.0000 )
          ( 0.7187  0.0659  0.0000 )
          ( 0.6972  0.0620  0.0000 )
          ( 0.6751  0.0582  0.0000 )
          ( 0.6526  0.0546  0.0000 )
          ( 0.6297  0.0511  0.0000 )
          ( 0.6065  0.0477  0.0000 )
          ( 0.5830  0.0445  0.0000 )
          ( 0.5592  0.0414  0.0000 )
          ( 0.5353  0.0385  0.0000 )
        )
      polyLine 15 14 (
          ( 0.5113  0.0356  0.0000 )
          ( 0.4873  0.0330  0.0000 )
          ( 0.4632  0.0304  0.0000 )
          ( 0.4392  0.0279  0.0000 )
          ( 0.4154  0.0256  0.0000 )
          ( 0.3917  0.0234  0.0000 )
          ( 0.3682  0.0213  0.0000 )
          ( 0.3450  0.0193  0.0000 )
          ( 0.3222  0.0174  0.0000 )
          ( 0.2998  0.0156  0.0000 )
          ( 0.2779  0.0140  0.0000 )
          ( 0.2564  0.0124  0.0000 )
          ( 0.2355  0.0109  0.0000 )
          ( 0.2152  0.0095  0.0000 )
          ( 0.1956  0.0083  0.0000 )
          ( 0.1767  0.0071  0.0000 )
          ( 0.1585  0.0060  0.0000 )
          ( 0.1411  0.0050  0.0000 )
          ( 0.1246  0.0041  0.0000 )
          ( 0.1089  0.0032  0.0000 )
          ( 0.0942  0.0025  0.0000 )
          ( 0.0803  0.0018  0.0000 )
          ( 0.0675  0.0012  0.0000 )
          ( 0.0557  0.0007  0.0000 )
          ( 0.0449  0.0002  0.0000 )
          ( 0.0352 -0.0002  0.0000 )
          ( 0.0265 -0.0006  0.0000 )
          ( 0.0190 -0.0009  0.0000 )
          ( 0.0126 -0.0011  0.0000 )
          ( 0.0073 -0.0013  0.0000 )
          ( 0.0032 -0.0015  0.0000 )
          ( 0.0026 -0.0012  0.0000 )
        )
      polyLine 48 57 (
          ( 0.0020  0.0020  0.1000 )
          ( 0.0025  0.0025  0.1000 )
          ( 0.0064  0.0037  0.1000 )
          ( 0.0114  0.0053  0.1000 )
          ( 0.0175  0.0073  0.1000 )
          ( 0.0247  0.0096  0.1000 )
          ( 0.0330  0.0122  0.1000 )
          ( 0.0422  0.0152  0.1000 )
          ( 0.0525  0.0184  0.1000 )
          ( 0.0638  0.0220  0.1000 )
          ( 0.0761  0.0258  0.1000 )
          ( 0.0893  0.0299  0.1000 )
          ( 0.1035  0.0342  0.1000 )
          ( 0.1185  0.0388  0.1000 )
          ( 0.1343  0.0436  0.1000 )
          ( 0.1510  0.0486  0.1000 )
          ( 0.1685  0.0538  0.1000 )
          ( 0.1866  0.0591  0.1000 )
          ( 0.2055  0.0647  0.1000 )
          ( 0.2251  0.0703  0.1000 )
          ( 0.2452  0.0761  0.1000 )
          ( 0.2659  0.0819  0.1000 )
          ( 0.2871  0.0879  0.1000 )
          ( 0.3088  0.0939  0.1000 )
          ( 0.3308  0.0999  0.1000 )
          ( 0.3533  0.1059  0.1000 )
          ( 0.3760  0.1120  0.1000 )
          ( 0.3991  0.1180  0.1000 )
          ( 0.4223  0.1240  0.1000 )
          ( 0.4457  0.1299  0.1000 )
          ( 0.4691  0.1357  0.1000 )
        )
      polyLine 57 58 (
          ( 0.5162  0.1469  0.1000 )
          ( 0.5397  0.1523  0.1000 )
          ( 0.5630  0.1576  0.1000 )
          ( 0.5862  0.1626  0.1000 )
          ( 0.6092  0.1674  0.1000 )
          ( 0.6319  0.1719  0.1000 )
          ( 0.6543  0.1762  0.1000 )
          ( 0.6763  0.1802  0.1000 )
          ( 0.6979  0.1839  0.1000 )
          ( 0.7191  0.1873  0.1000 )
          ( 0.7397  0.1903  0.1000 )
          ( 0.7597  0.1931  0.1000 )
          ( 0.7791  0.1954  0.1000 )
          ( 0.7979  0.1974  0.1000 )
          ( 0.8160  0.1991  0.1000 )
          ( 0.8333  0.2004  0.1000 )
          ( 0.8499  0.2013  0.1000 )
          ( 0.8656  0.2018  0.1000 )
          ( 0.8805  0.2020  0.1000 )
          ( 0.8944  0.2018  0.1000 )
        )
      polyLine 58 51 (
          ( 0.9196  0.2004  0.1000 )
          ( 0.9307  0.1991  0.1000 )
          ( 0.9407  0.1975  0.1000 )
          ( 0.9498  0.1956  0.1000 )
          ( 0.9578  0.1933  0.1000 )
          ( 0.9647  0.1907  0.1000 )
          ( 0.9705  0.1878  0.1000 )
          ( 0.9752  0.1846  0.1000 )
          ( 0.9787  0.1811  0.1000 )
        )
      polyLine 51 50 (
          ( 0.9817  0.1645  0.1000 )
          ( 0.9795  0.1600  0.1000 )
          ( 0.9762  0.1554  0.1000 )
          ( 0.9717  0.1507  0.1000 )
          ( 0.9661  0.1459  0.1000 )
          ( 0.9594  0.1411  0.1000 )
          ( 0.9516  0.1362  0.1000 )
          ( 0.9426  0.1312  0.1000 )
          ( 0.9326  0.1262  0.1000 )
          ( 0.9216  0.1212  0.1000 )
          ( 0.9095  0.1163  0.1000 )
          ( 0.8965  0.1113  0.1000 )
          ( 0.8824  0.1064  0.1000 )
        )
      polyLine 50 49 (
          ( 0.8516  0.0967  0.1000 )
          ( 0.8349  0.0920  0.1000 )
          ( 0.8173  0.0874  0.1000 )
          ( 0.7990  0.0828  0.1000 )
          ( 0.7799  0.0784  0.1000 )
          ( 0.7602  0.0741  0.1000 )
          ( 0.7398  0.0699  0.1000 )
          ( 0.7187  0.0659  0.1000 )
          ( 0.6972  0.0620  0.1000 )
          ( 0.6751  0.0582  0.1000 )
          ( 0.6526  0.0546  0.1000 )
          ( 0.6297  0.0511  0.1000 )
          ( 0.6065  0.0477  0.1000 )
          ( 0.5830  0.0445  0.1000 )
          ( 0.5592  0.0414  0.1000 )
          ( 0.5353  0.0385  0.1000 )
        )
      polyLine 49 48 (
          ( 0.5113  0.0356  0.1000 )
          ( 0.4873  0.0330  0.1000 )
          ( 0.4632  0.0304  0.1000 )
          ( 0.4392  0.0279  0.1000 )
          ( 0.4154  0.0256  0.1000 )
          ( 0.3917  0.0234  0.1000 )
          ( 0.3682  0.0213  0.1000 )
          ( 0.3450  0.0193  0.1000 )
          ( 0.3222  0.0174  0.1000 )
          ( 0.2998  0.0156  0.1000 )
          ( 0.2779  0.0140  0.1000 )
          ( 0.2564  0.0124  0.1000 )
          ( 0.2355  0.0109  0.1000 )
          ( 0.2152  0.0095  0.1000 )
          ( 0.1956  0.0083  0.1000 )
          ( 0.1767  0.0071  0.1000 )
          ( 0.1585  0.0060  0.1000 )
          ( 0.1411  0.0050  0.1000 )
          ( 0.1246  0.0041  0.1000 )
          ( 0.1089  0.0032  0.1000 )
          ( 0.0942  0.0025  0.1000 )
          ( 0.0803  0.0018  0.1000 )
          ( 0.0675  0.0012  0.1000 )
          ( 0.0557  0.0007  0.1000 )
          ( 0.0449  0.0002  0.1000 )
          ( 0.0352 -0.0002  0.1000 )
          ( 0.0265 -0.0006  0.1000 )
          ( 0.0190 -0.0009  0.1000 )
          ( 0.0126 -0.0011  0.1000 )
          ( 0.0073 -0.0013  0.1000 )
          ( 0.0032 -0.0015  0.1000 )
          ( 0.0026 -0.0012  0.1000 )
        )
 );
 
 patches
 (
       wall top
     (
      ( 28 29 63 62)
      ( 29 30 64 63)
      ( 30 31 65 64)
      ( 31 32 66 65)
      ( 32 33 67 66)
     )
    patch inlet
     (
      ( 67 33 27 61)
      ( 61 27 19 53)
      ( 53 19 11 45)
      ( 45 11  5 39)
     )
    wall bottom
     (
      (  0 34 35  1)
      (  1 35 36  2)
      (  2 36 37  3)
      (  3 37 38  4)
      (  4 38 39  5)
     )
   patch outlet
     (
      ( 28 62 54 20)
      ( 20 54 46 12)
      ( 12 46 40  6)
      (  6 40 34  0)
     )
      wall wing
     (
      ( 14 48 57 23)
      ( 23 57 58 24)
      ( 24 58 51 17)
      ( 16 17 51 50)
      ( 15 16 50 49)
      ( 14 15 49 48)
     )
 );
 
 mergePatchPairs
 (
 );
 
  //* * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
